<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-paid-features","backend_type":"remote","backend":"acef2cc61c6041a21434e49bde2582d67847197b9324b39d0be0ecb5e3c4106a","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #260 at https://github.com/scidsg/hushline/actions/runs/10798728485","plan_out_hash":"b41ff42aa091f99876c2fc3c5341c46d29b0d120ce3cac9469b4e03e66254b8e","plan_hash":"d48b3bd02954d2341cb3b059ceb9b8c47a9ef63583d0dee10c45439251a2e6be","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-paid-features__ workspace<details open><summary>With variables</summary>

```hcl
branch = "paid-features"
name   = "dev-paid-features"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.digitalocean_app.app must be replaced
-/+ resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
!~      created_at           = "2024-09-10 18:28:56 +0000 UTC" -> (known after apply)
+       default_ingress      = (known after apply)
!~      id                   = "************************************" -> (known after apply)
+       live_url             = (known after apply)
!~      updated_at           = "2024-09-10 18:46:35 +0000 UTC" -> (known after apply)
!~      urn                  = "do:app:584263fb-d01d-47c5-ba22-2104a69a3cf1" -> (known after apply)
#        (1 unchanged attribute hidden)

!~      dedicated_ips {
+           active_deployment_id = (known after apply)
+           created_at           = (known after apply)
+           default_ingress      = (known after apply)
+           id                   = (known after apply)
+           live_url             = (known after apply)
+           project_id           = (known after apply)
+           updated_at           = (known after apply)
+           urn                  = (known after apply)
        } -> (known after apply)

!~      spec {
!~          domains  = [] -> (known after apply)
            name     = "dev-paid-features"
#            (2 unchanged attributes hidden)

!~          domain {
+               domains  = (known after apply)
+               features = (known after apply)
+               name     = (known after apply)
+               region   = (known after apply)
            } -> (known after apply)

!~          ingress {
+               domains  = (known after apply)
+               features = (known after apply)
+               name     = (known after apply)
+               region   = (known after apply)
            } -> (known after apply)

!~          service {
!~              internal_ports     = [] -> (known after apply)
                name               = "app"
+               run_command        = (known after apply)
#                (7 unchanged attributes hidden)

!~              health_check {
-                   failure_threshold     = 0 -> null
-                   initial_delay_seconds = 0 -> null
-                   period_seconds        = 0 -> null
-                   port                  = 0 -> null
-                   success_threshold     = 0 -> null
-                   timeout_seconds       = 0 -> null
#                    (1 unchanged attribute hidden)
                }

!~              routes {
+                   build_command      = (known after apply)
+                   dockerfile_path    = (known after apply)
+                   environment_slug   = (known after apply)
+                   http_port          = (known after apply)
+                   instance_count     = (known after apply)
+                   instance_size_slug = (known after apply)
+                   internal_ports     = (known after apply)
+                   name               = (known after apply)
+                   run_command        = (known after apply)
+                   source_dir         = (known after apply)
                } -> (known after apply)

#                (1 unchanged block hidden)
            }

#            (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #260](https://github.com/scidsg/hushline/actions/runs/10798728485)